  const data = [
  {
    "id": 1,
    "text": "Шторм, кораблекрушение",
    "bg": "bb1.jpg",
    "className": "11111",
    "buttons": [
      {
        "id": 1,
        "text": "дальше",
        "go": "2",
        "ifRegExp": "s1"
      }
    ]
  },
  {
    "id": 2,
    "text": "Берег, пополнение припасов",
    "bg": "bb2.jpg",
    "className": "222222",
    "buttons": [
      {
        "id": 2,
        "text": "Дальше",
        "go": "3"
      }
    ]
  },
  {
    "id": 3,
    "text": "Выбор с лесом (Первый)",
    "bg": "bb3.jpg",
    "buttons": [
      {
        "id": 3,
        "text": "Лес",
        "go": "4"
      },
      {
        "id": 4,
        "text": "Берег",
        "go": "5"
      }
    ]
  },
  {
    "id": 4,
    "text": "Зайти в лес",
    "bg": "bb5.jpg",
    "buttons": [
      {
        "id": 5,
        "text": "Дальше",
        "go": "6"
      }
    ]
  },
  {
    "id": 5,
    "text": "Продолжить путь по побережью",
    "bg": "bb6.jpg",
    "buttons": [
      {
        "id": 6,
        "text": "Дальше",
        "go": "7"
      }
    ]
  },
  {
    "id": 6,
    "text": "Концовка (Вы погибли!)",
    "bg": "bb4.jpg",
    "buttons": [
      {
        "id": 16,
        "text": "В начало",
        "go": "1"
      }
    ]
  },
  {
    "id": 7,
    "text": "Путь продолжается, начинается полдень",
    "bg": "bb7.jpg",
    "buttons": [
      {
        "id": 7,
        "text": "Дальше",
        "go": "10"
      }
    ]
  },
  {
    "id": 8,
    "text": "Пойти снова в лес",
    "bg": "bb9.jpg",
    "buttons": [
      {
        "id": 11,
        "text": "Дальше",
        "go": "12"
      }
    ]
  },
  {
    "id": 9,
    "text": "Дальше идти",
    "bg": null,
    "buttons": [
      {
        "id": 10,
        "text": "Дальше",
        "go": "11"
      }
    ]
  },
  {
    "id": 10,
    "text": "Запасы хватают на день-другой, при этом приблизительно.\nМожет пополнить их? Лес всё ещё рядом",
    "bg": "bb8.jpg",
    "buttons": [
      {
        "id": 8,
        "text": "Зайти в лес",
        "go": "8"
      },
      {
        "id": 9,
        "text": "Остаться на берегу",
        "go": "9"
      }
    ]
  },
  {
    "id": 11,
    "text": "Путь продолжаетс",
    "bg": null,
    "buttons": [
      {
        "id": 13,
        "text": "Дальше",
        "go": "14"
      }
    ]
  },
  {
    "id": 12,
    "text": "Находка знакомых ягод. Пополнение запаса",
    "bg": null,
    "buttons": [
      {
        "id": 12,
        "text": "Дальше",
        "go": "13"
      }
    ]
  },
  {
    "id": 13,
    "text": "(Далее по лору подробности пропускаем) \n Вайт падает без сознания",
    "bg": null,
    "buttons": [
      {
        "id": 14,
        "text": "Дальше",
        "go": "15"
      }
    ]
  },
  {
    "id": 14,
    "text": "Также падает без сознания",
    "bg": null,
    "buttons": [
      {
        "id": 15,
        "text": "Дальше",
        "go": "16"
      }
    ]
  },
  {
    "id": 15,
    "text": "Пробуждение в Серебряном королевстве, с более выдержанном виде",
    "bg": null,
    "buttons": []
  },
  {
    "id": 16,
    "text": "Пробуждение там же, но есть нехватка сил.",
    "bg": null,
    "buttons": []
  }
]